# 彻底理解Cookie，Session，Token

## 背景

开发MOMO渠道的时候进行学习相关基础概念

## 内容

cookie 是一个非常具体的东西，指的就是浏览器里面能永久存储的一种数据，仅仅是浏览器实现的一种数据存储功能。cookie由服务器生成，发送给浏览器，浏览器把cookie保存到本地某个目录下的文本文件内，下一次请求同一网站时会把该cookie发送给服务器。由于cookie是存在客户端上的，所以浏览器加入了一些限制确保cookie不会被恶意使用，同时不会占据太多磁盘空间，所以每个域的cookie数量是有限的
服务器使用session把用户的信息临时保存在了服务器上，用户离开网站后session会被销毁。
这对服务器说是一个巨大的开销 ， 严重的限制了服务器扩展能力。
session有一个缺陷：如果web服务器做了负载均衡，那么下一个操作请求到了另一台服务器的时候session会丢失。
Token 中的数据是明文保存的（虽然我会用Base64做下编码， 但那不是加密）我就不保存session id 了， 我只是生成token , 然后验证token ， 我用我的CPU计算时间获取了我的session 存储空间 ！解除了session id这个负担， 可以说是无事一身轻，基于Token的身份验证是无状态的，我们不将用户信息存在服务器或Session中。NoSession意味着你的程序可以根据业务需要去增减机器，而不用去担心用户是否登录。这种无状态的感觉实在是太好了


